# Pandas - Exploratory Data Analysis
kita akan meng-explore data menggunakan bantuan Pandas

- handle missing values
- handle invalid values
- merapikan datanya sebisa mungkin
- mencari pattern di data

In [1]:
import numpy as np
import pandas as pd

# standard missing values
# non-standard missing values
# unexpected missing values
# summarize missing values
# checking duplicates
# case study
# time series

kita akan menggunakan sample data https://raw.githubusercontent.com/ardhiraka/PFDS_sources/master/property_data.csv yang memiliki banyak missing values tipe berbeda-beda.

kita akan handle missing values tersebut.

In [3]:
# 1. import data
df = pd.read_csv("https://raw.githubusercontent.com/ardhiraka/PFDS_sources/master/property_data.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PID           8 non-null      float64
 1   ST_NUM        7 non-null      float64
 2   ST_NAME       9 non-null      object
 3   OWN_OCCUPIED  8 non-null      object
 4   NUM_BEDROOMS  7 non-null      object
 5   NUM_BATH      8 non-null      object
 6   SQ_FT         8 non-null      object
dtypes: float64(2), object(5)
memory usage: 632.0+ bytes

In [4]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y           --        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

NaN adalah standard missing values yang otomatis terdeteksi oleh Pandas sebagai missing value

missing value seperti ini bisa kita rangkum, bisa kita sum total nya ada berapa. bisa kita isi dengan fillna. bisa kita drop dengan dropna. dia terdeteksi sehingga bisa kita gunakan function2 missing value dari pandas.

untuk missing value seperti "--" "na" "-" "n/a" atau lainnya yang tidak dianggap NaN, itu adalah non-standard missing values. tidak dianggap sebagai missing values oleh dataframe kita.

In [35]:
# standard missing values

# for index in df.index:
#     row = df.loc[[index]]
#     display(row)

# cari semua data yang ada missing value di kolom PID
kon_PID_kosong = df["PID"].isnull()

data_PID_kosong = df[kon_PID_kosong]

# untuk setiap baris data di data_PID_kosong, kita isi dengan value baris sebelumnya + 1000
for index in data_PID_kosong.index:
    if (index == 0): continue
    
    df.loc[[index], 'PID'] = float(df.loc[[index-1], 'PID'] + 1000)

In [36]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4  100005000.0   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y           --        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [39]:
# untuk kolom ST_NUM, kita bisa isi missing values nya menggunakan angka rata-rata
st_num_mean = int(df["ST_NUM"].mean())
print(st_num_mean)

df["ST_NUM"] = df["ST_NUM"].fillna(st_num_mean)

191

In [40]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0   191.0   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4  100005000.0   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0   191.0  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y           --        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [41]:
# non-standard missing values
# kalau kita sudah tau bahwa ada bbrp text yang dianggap missing values, seperti "na" atau "--"
# kita bisa minta Pandas untuk membuat value tersebut menjadi NaN saat di import

df2 = pd.read_csv("https://raw.githubusercontent.com/ardhiraka/PFDS_sources/master/property_data.csv",
                    na_values = ["na", "--"])

df2

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           NaN        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [42]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PID           8 non-null      float64
 1   ST_NUM        7 non-null      float64
 2   ST_NAME       9 non-null      object
 3   OWN_OCCUPIED  8 non-null      object
 4   NUM_BEDROOMS  5 non-null      float64
 5   NUM_BATH      8 non-null      object
 6   SQ_FT         7 non-null      float64
dtypes: float64(4), object(3)
memory usage: 632.0+ bytes

In [43]:
# pakai to_numeric dan coerce untuk memastikan tipe data numerik semua di kolom NUM_BATH

pd.to_numeric(df2["NUM_BATH"], errors="coerce")

0    1.0
1    1.5
2    1.0
3    NaN
4    2.0
5    1.0
6    NaN
7    1.0
8    2.0
Name: NUM_BATH, dtype: float64

In [44]:
df2["NUM_BATH"] = pd.to_numeric(df2["NUM_BATH"], errors="coerce")

df2

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000.0,104.0,PUTNAM,Y,3.0,1.0,1000.0
1,100002000.0,197.0,LEXINGTON,N,3.0,1.5,NaN
2,100003000.0,NaN,LEXINGTON,N,NaN,1.0,850.0
3,100004000.0,201.0,BERKELEY,12,1.0,NaN,700.0
4,NaN,203.0,BERKELEY,Y,3.0,2.0,1600.0
5,100006000.0,207.0,BERKELEY,Y,NaN,1.0,800.0
6,100007000.0,NaN,WASHINGTON,NaN,2.0,NaN,950.0
7,100008000.0,213.0,TREMONT,Y,NaN,1.0,NaN
8,100009000.0,215.0,TREMONT,Y,NaN,2.0,1800.0

In [45]:
# untuk kolom OWN_OCCUPIED yang isinya hanya Y atau N, kita bisa paksa dia hanya isi Y atau N
# dengan menggunakan tipe data Categorical
pd.Categorical(df2["OWN_OCCUPIED"], categories=["Y","N"])

['Y', 'N', 'N', NaN, 'Y', 'Y', NaN, 'Y', 'Y']
Categories (2, object): ['Y', 'N']

In [46]:
df2["OWN_OCCUPIED"] = pd.Categorical(df2["OWN_OCCUPIED"], categories=["Y","N"])
df2

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000.0,104.0,PUTNAM,Y,3.0,1.0,1000.0
1,100002000.0,197.0,LEXINGTON,N,3.0,1.5,NaN
2,100003000.0,NaN,LEXINGTON,N,NaN,1.0,850.0
3,100004000.0,201.0,BERKELEY,NaN,1.0,NaN,700.0
4,NaN,203.0,BERKELEY,Y,3.0,2.0,1600.0
5,100006000.0,207.0,BERKELEY,Y,NaN,1.0,800.0
6,100007000.0,NaN,WASHINGTON,NaN,2.0,NaN,950.0
7,100008000.0,213.0,TREMONT,Y,NaN,1.0,NaN
8,100009000.0,215.0,TREMONT,Y,NaN,2.0,1800.0

In [48]:
# menghitung jumlah missing values
# kita bisa pakai .isnull()

df2.isnull()

     PID  ST_NUM  ST_NAME  OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH  SQ_FT
0  False   False    False         False         False     False  False
1  False   False    False         False         False     False   True
2  False    True    False         False          True     False  False
3  False   False    False          True         False      True  False
4   True   False    False         False         False     False  False
5  False   False    False         False          True     False  False
6  False    True    False          True         False      True  False
7  False   False    False         False          True     False   True
8  False   False    False         False          True     False  False

In [49]:
# dan ditambah bantuan agregasi .sum()
df2.isnull().sum()

PID             1
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    2
NUM_BEDROOMS    4
NUM_BATH        2
SQ_FT           2
dtype: int64

kita bisa lihat total missing values per kolom

In [52]:
# kalau mau overall jumlah missing value di dataframe kita ada berapa, kita bisa tumpuk sum nya
total_missing_values = df2.isnull().sum().sum()
total_missing_values

13

In [53]:
# hitung persentase missing values
total_data = df2.size
total_data

63

In [56]:
print( np.round(total_missing_values / total_data * 100, 2), "% missing values")

20.63 % missing values

In [ ]:
# checking duplicates
# case study
# time series

## best practice Data Exploration
1. Introduction: perkenalan data, background data, saat import data kita ada tujuan analisa datanya
2. Data Cleaning: handle missing values, invalid values
3. Exploratory Data Analysis: explorasi data - cari pattern, charts, statistic, mencari tren/ korelasi/ cerita dari data mentah
4. Conclusion: membuat summary, membuat cerita, konklusi hasil analisa data

In [66]:
# checking duplicates

df3 = pd.DataFrame(index=["PUTNAM", "LEXINGTON", "BERKELEY", "LEXINGTON"], data={"NUM_HOUSE": [5,7,7,7]})
df3

           NUM_HOUSE
PUTNAM             5
LEXINGTON          7
BERKELEY           7
LEXINGTON          7

In [69]:
# reset_index() untuk memasukkan index ke kolom, index jadi angka urut
df3 = df3.reset_index()
df3

       index  NUM_HOUSE
0     PUTNAM          5
1  LEXINGTON          7
2   BERKELEY          7
3  LEXINGTON          7

In [70]:
# ganti judul kolom
df3 = df3.rename(columns={"index":"STREET_NAME"})
df3

  STREET_NAME  NUM_HOUSE
0      PUTNAM          5
1   LEXINGTON          7
2    BERKELEY          7
3   LEXINGTON          7

In [71]:
# cek duplikat
df3.duplicated()

0    False
1    False
2    False
3     True
dtype: bool

In [73]:
# kita bisa pakai sebagai kondisi
data_yang_duplikat = df3.duplicated()

df3[data_yang_duplikat]

  STREET_NAME  NUM_HOUSE
3   LEXINGTON          7

note: fungsi duplicated() hanya mengecek value yang sama persis antara rows di semua kolom, tidak cek index nya

In [72]:
# cara cepat menghapus duplicated data
df3.drop_duplicates()

  STREET_NAME  NUM_HOUSE
0      PUTNAM          5
1   LEXINGTON          7
2    BERKELEY          7

In [75]:
# jangan lupa untuk replace data awal kita ke data yang baru, yang sudah dihapus duplikatnya
df3 = df3.drop_duplicates()
df3

  STREET_NAME  NUM_HOUSE
0      PUTNAM          5
1   LEXINGTON          7
2    BERKELEY          7